In [25]:
import pandas as pd
import numpy as np
people={
    "first":["Corey","Jane","John"],
    "last":["Schafer","Doe", "Doe"],
    "email":["corey@gmail.com","Jane@gmail.com","john@gmail.com"]
}
df=pd.DataFrame(people)

In [26]:
df

   first     last            email
0  Corey  Schafer  corey@gmail.com
1   Jane      Doe   Jane@gmail.com
2   John      Doe   john@gmail.com

In [27]:
df['first']+' '+df['last']

0    Corey Schafer
1         Jane Doe
2         John Doe
dtype: object

In [28]:
df['full_Name']=df['first']+' '+df['last']

In [5]:
df

   first     last            email      full_Name
0  Corey  Schafer  corey@gmail.com  Corey Schafer
1   Jane      Doe   Jane@gmail.com       Jane Doe
2   John      Doe   john@gmail.com       John Doe

In [29]:
#deleting columns
df.drop(columns=['first','last'],inplace=True)

In [30]:
df

             email      full_Name
0  corey@gmail.com  Corey Schafer
1   Jane@gmail.com       Jane Doe
2   john@gmail.com       John Doe

In [31]:
df['full_Name'].str.split(' ',expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [32]:
df[['first','last']]=df['full_Name'].str.split(' ',expand=True)
df

             email      full_Name  first     last
0  corey@gmail.com  Corey Schafer  Corey  Schafer
1   Jane@gmail.com       Jane Doe   Jane      Doe
2   john@gmail.com       John Doe   John      Doe

In [33]:
df

             email      full_Name  first     last
0  corey@gmail.com  Corey Schafer  Corey  Schafer
1   Jane@gmail.com       Jane Doe   Jane      Doe
2   john@gmail.com       John Doe   John      Doe

In [37]:
df.append({'first':'Tony'},index=True)

AttributeError: 'DataFrame' object has no attribute 'append'

In [40]:
people={
    "first":["Tony","Steve"],
    "last":["Stark","Rogers"],
    "email":["IronMan@avenge.com","cap@avenge.com"]
}
df2=pd.DataFrame(people)

In [41]:
df2

   first    last               email
0   Tony   Stark  IronMan@avenge.com
1  Steve  Rogers      cap@avenge.com

In [46]:
df=pd.concat([df,df2],ignore_index=True,sort=False)

In [47]:
df

                email      full_Name  first     last
0     corey@gmail.com  Corey Schafer  Corey  Schafer
1      Jane@gmail.com       Jane Doe   Jane      Doe
2      john@gmail.com       John Doe   John      Doe
3  IronMan@avenge.com            NaN   Tony    Stark
4      cap@avenge.com            NaN  Steve   Rogers

In [48]:
df.drop(index=4)

                email      full_Name  first     last
0     corey@gmail.com  Corey Schafer  Corey  Schafer
1      Jane@gmail.com       Jane Doe   Jane      Doe
2      john@gmail.com       John Doe   John      Doe
3  IronMan@avenge.com            NaN   Tony    Stark

In [49]:
df.drop(index=4,inplace=True)

In [55]:
filt=df['last']=='Doe'
df.drop(index=df[filt].index)

                email      full_Name  first     last
0     corey@gmail.com  Corey Schafer  Corey  Schafer
3  IronMan@avenge.com            NaN   Tony    Stark